engineer-ae3o/stm32-hal-library/components/drivers/src/adc.c
// Control of all the ADC instances
void adc_clk_configure(adc_prescaler_t clk_prescaler) {
    // Set the ADC clock prescaler
    ADC->CCR &= ~ADC_CCR_ADCPRE;
    ADC->CCR |= ((uint32_t)clk_prescaler << ADC_CCR_ADCPRE_Pos);
}

void adc_enable_nvic_irq(bool enable) {
    if (enable) {
        NVIC_SetPriority(ADC_IRQn, ADC_DMA_NVIC_IRQ_PRIORITY);
        NVIC_EnableIRQ(ADC_IRQn);
    } else {
        NVIC_DisableIRQ(ADC_IRQn);
    }
}

void adc_power_on_temp_sensor(bool on) {
    if (on) {
        ADC->CCR |= ADC_CCR_TSVREFE;
        delay_us(TEMP_SENSOR_STARUP_TIME_US);
    } else {
        ADC->CCR &= ~ADC_CCR_TSVREFE;
    }
}


// For use with the regular group and external channels in polling oneshot mode
hal_err_t adc_regular_group_get_oneshot(ADC_TypeDef* handle, adc_channels_t channel, uint16_t* raw_data) {
    if (handle == NULL || raw_data == NULL) {
        return HAL_ERR_INVALID_ARG;
    }

    // Get the raw ADC data
    const uint16_t raw = oneshot_regular_group(handle, channel);
    if (raw == UINT16_MAX) {
        return HAL_ERR_TIMEOUT;
    }

    *raw_data = raw;
    return HAL_OK;
}


// For use with the regular group and external channels in DMA continuous sampling mode
hal_err_t adc_regular_group_cont_start_conv(ADC_TypeDef* handle, const adc_continuous_config_t* config) {
    if (handle == NULL || config == NULL || config->channels.channels_sequence == NULL || config->channels.num_of_channels == 0 ||
        config->channels.num_of_channels > MAX_REGULAR_CHANNELS || config->buffer_1 == NULL) {
        return HAL_ERR_INVALID_ARG;
    }

    const uint8_t idx = get_index(handle);
    if (idx == 0xFFU) {
        return HAL_ERR_INVALID_ARG;
    }

    // TODO: Set the channel length and sequence
    (void)config->channels.channels_sequence;
    (void)config->channels.num_of_channels;

    // Enable scan mode if we have more than one channel, but disable otherwise
    if (config->channels.num_of_channels > 1) {
        handle->CR1 |= ADC_CR1_SCAN;
    } else {
        handle->CR1 &= ~ADC_CR1_SCAN;
    }

    // Enable ADC continuous sampling and DMA mode
    handle->CR2 |= (ADC_CR2_CONT | ADC_CR2_DMA);

    // Clear the EXTEN bit since we are triggering the conversion manually with the SWSTART bit
    handle->CR2 &= ~ADC_CR2_EXTEN;

    // Disable the ADC end of conversion interrupt since the DMA controller
    // will trigger its own interrupt when our buffer is filled. Discontinuous
    // mode is also disabled since it's not being used.
    handle->CR1 &= ~(ADC_CR1_EOCIE | ADC_CR1_DISCEN);

    // ADC DMA stream mapping
    DMA_TypeDef*        adc_dma_controller = s_adc_dma_map[idx].tx.controller;
    DMA_Stream_TypeDef* adc_dma_stream     = s_adc_dma_map[idx].tx.stream;
    const uint8_t       adc_dma_channel    = s_adc_dma_map[idx].tx.channel;
    const uint8_t       adc_dma_stream_no  = s_adc_dma_map[idx].tx.stream_no;
    const IRQn_Type     adc_dma_irq_type   = s_adc_dma_map[idx].tx.irq_type;

    if (adc_dma_controller == NULL || adc_dma_stream == NULL) {
        return HAL_ERR_NOT_SUPPORTED;
    }

    // Enable the DMA clock and disable the stream
    TRY(dmax_clk_enable(adc_dma_controller, true));
    TRY(dma_disable_stream(adc_dma_stream));

    // Clear the global DMA interrupt flags
    TRY(dma_clear_flags(adc_dma_controller, adc_dma_stream_no));

    // Configuration of the DMA stream
    dma_set_direction(adc_dma_stream, DMA_DIR_P_M);
    dma_set_direct_mode(adc_dma_stream, true);
    dma_set_channel(adc_dma_stream, adc_dma_channel);
    dma_set_increment(adc_dma_stream, false, true);
    dma_set_flow_controller(adc_dma_stream, true);
    dma_set_trans_length(adc_dma_stream, config->buffer_size);
    dma_set_stream_priority(adc_dma_stream, DMA_PRIORITY_HIGH);
    dma_set_per_mem_size(adc_dma_stream, DMA_SIZE_HWORD, DMA_SIZE_HWORD);

    if (config->use_double_buffers) {
        if (config->buffer_2 == NULL) {
            return HAL_ERR_INVALID_ARG;
        }
        dma_enable_circm_dbm(adc_dma_stream, true, true);
        dma_set_addresses(adc_dma_stream, &handle->DR, config->buffer_1, config->buffer_2);
    } else if (config->dma_wraparound_when_done) {
        dma_enable_circm_dbm(adc_dma_stream, true, false);
        dma_set_addresses(adc_dma_stream, &handle->DR, config->buffer_1, NULL);
    } else {
        dma_enable_circm_dbm(adc_dma_stream, false, false);
        dma_set_addresses(adc_dma_stream, &handle->DR, config->buffer_1, NULL);
    }

    // TODO: Handle the callback registration
    s_continuous_mode_callbacks[idx] = config->callbacks;

    // Enable the DMA stream interrupts
    NVIC_SetPriority(adc_dma_irq_type, ADC_DMA_NVIC_IRQ_PRIORITY);
    NVIC_EnableIRQ(adc_dma_irq_type);

    // Enable the DMA stream after all DMA configuration is complete
    TRY(dma_enable_stream(adc_dma_stream));

    // Start the conversion
    handle->CR2 |= ADC_CR2_SWSTART;

    return HAL_OK;
}

hal_err_t adc_regular_group_cont_end_conv(ADC_TypeDef* handle) {
    const uint8_t idx = get_index(handle);
    if (idx == 0xFFU) {
        return HAL_ERR_INVALID_ARG;
    }

    // Clear all state and stop the conversion.
    handle->CR1 &= ~ADC_CR1_SCAN;
    handle->CR2 &= ~(ADC_CR2_CONT | ADC_CR2_DMA | ADC_CR2_SWSTART);

    // ADC DMA stream mapping
    DMA_TypeDef*        adc_dma_controller = s_adc_dma_map[idx].tx.controller;
    DMA_Stream_TypeDef* adc_dma_stream     = s_adc_dma_map[idx].tx.stream;
    const uint8_t       adc_dma_stream_no  = s_adc_dma_map[idx].tx.stream_no;

    if (adc_dma_controller == NULL || adc_dma_stream == NULL) {
        return HAL_ERR_NOT_SUPPORTED;
    }

    // Then disable the stream, disable all interrupts and clear the interrupt flags
    TRY(dma_disable_stream(adc_dma_stream));
    TRY(dma_clear_flags(adc_dma_controller, adc_dma_stream_no));
    dma_enable_irqs(adc_dma_stream, false, false, false, false);

    // Clear all user passed callbacks
    memset(&s_continuous_mode_callbacks, 0, sizeof(s_continuous_mode_callbacks));

    return HAL_OK;
}


// For use with the injected group and external channels with interrupts
hal_err_t adc_injected_group_start_conv(ADC_TypeDef* handle, const adc_channels_config_t* channels, adc_callback_t cb, void* arg) {
    if (handle == NULL || channels->channels_sequence == NULL || channels->num_of_channels == 0 ||
        channels->num_of_channels > MAX_INJECTED_CHANNELS) {
        return HAL_ERR_INVALID_ARG;
    }

    const uint8_t idx = get_index(handle);
    if (idx == 0xFFU) {
        return HAL_ERR_INVALID_ARG;
    }

    if (cb) {
        // Save the user passed callback
        s_injected_done_cb[idx]  = cb;
        s_injected_done_arg[idx] = arg;

        // Enable interrupts for the injected group on conversion
        // completion only if the user passed in a callback.
        handle->CR1 |= ADC_CR1_JEOCIE;
    }

    // Set the number of channels/conversions in the JL bit positions of the
    // JSQR register. The JL bit positions are zero indexed. That is, 1 channel
    // means a JL value of 0b00, 3 channels means a JL value of 0b10 etc.
    handle->JSQR &= ~(ADC_JSQR_JL | ADC_JSQR_JSQ1 | ADC_JSQR_JSQ2 | ADC_JSQR_JSQ3 | ADC_JSQR_JSQ4);
    handle->JSQR |= (((channels->num_of_channels - 1) & 0x3U) << ADC_JSQR_JL_Pos);

    // Set the channel sequence in the JSQ register
    // As per the TRM, there are only 4 injected channels, and they have to be filled from the last
    // slot, that is, JSQ4. This is because all conversions in the injected group must end at JSQ4
    switch (channels->num_of_channels) {
        case 1:
            handle->JSQR |= (uint32_t)(channels->channels_sequence[0] << ADC_JSQR_JSQ4_Pos);
            break;
        case 2:
            handle->JSQR |= (uint32_t)((channels->channels_sequence[0] << ADC_JSQR_JSQ3_Pos) | (channels->channels_sequence[1] << ADC_JSQR_JSQ4_Pos));
            break;
        case 3:
            handle->JSQR |= (uint32_t)((channels->channels_sequence[0] << ADC_JSQR_JSQ2_Pos) | (channels->channels_sequence[1] << ADC_JSQR_JSQ3_Pos) |
                                       (channels->channels_sequence[2] << ADC_JSQR_JSQ4_Pos));
            break;
        case 4:
            handle->JSQR |= (uint32_t)((channels->channels_sequence[0] << ADC_JSQR_JSQ1_Pos) | (channels->channels_sequence[1] << ADC_JSQR_JSQ2_Pos) |
                                       (channels->channels_sequence[2] << ADC_JSQR_JSQ3_Pos) | (channels->channels_sequence[3] << ADC_JSQR_JSQ4_Pos));
            break;
        default:
            return HAL_ERR_INVALID_ARG;
    }

    // Clear all offsets registers since not used
    handle->JOFR1 &= ~ADC_JOFR1_JOFFSET1;
    handle->JOFR2 &= ~ADC_JOFR2_JOFFSET2;
    handle->JOFR3 &= ~ADC_JOFR3_JOFFSET3;
    handle->JOFR4 &= ~ADC_JOFR4_JOFFSET4;

    // Enable scan mode if we have more than one channel, but disable otherwise
    if (channels->num_of_channels > 1) {
        handle->CR1 |= ADC_CR1_SCAN;
    } else {
        handle->CR1 &= ~ADC_CR1_SCAN;
    }

    // Clear the JEXTEN bit since the triggering is from software. Also,
    // the JAUTO bit is cleared so the ADC interrupts any ongoing regular
    // group conversion to perform this injected group conversion.
    handle->CR2 &= ~ADC_CR2_JEXTEN;
    handle->CR1 &= ~ADC_CR1_JAUTO;

    // Start the conversion and return. The JEOC interrupt will fire
    // when the ADC controller is finished with the conversion(s).
    handle->CR2 |= ADC_CR2_JSWSTART;

    return HAL_OK;
}

hal_err_t adc_injected_group_get_result(ADC_TypeDef* handle, uint16_t* raw_data_buffer, size_t buffer_size) {
    if (handle == NULL || raw_data_buffer == NULL || buffer_size == 0 || buffer_size > MAX_INJECTED_CHANNELS) {
        return HAL_ERR_INVALID_ARG;
    }

    const uint8_t idx = get_index(handle);
    if (idx == 0xFFU) {
        return HAL_ERR_INVALID_ARG;
    }

    // If the JEOC bit is not set, conversion is not yet done
    if (!(handle->SR & ADC_SR_JEOC)) {
        return HAL_ERR_NOT_DONE;
    }

    // Read the injected group data registers. Can switch over them since only 4 data registers
    switch (buffer_size) {
        case 1:
            raw_data_buffer[0] = (uint16_t)handle->JDR1;
            break;
        case 2:
            raw_data_buffer[0] = (uint16_t)handle->JDR1;
            raw_data_buffer[1] = (uint16_t)handle->JDR2;
            break;
        case 3:
            raw_data_buffer[0] = (uint16_t)handle->JDR1;
            raw_data_buffer[1] = (uint16_t)handle->JDR2;
            raw_data_buffer[2] = (uint16_t)handle->JDR3;
            break;
        case 4:
            raw_data_buffer[0] = (uint16_t)handle->JDR1;
            raw_data_buffer[1] = (uint16_t)handle->JDR2;
            raw_data_buffer[2] = (uint16_t)handle->JDR3;
            raw_data_buffer[3] = (uint16_t)handle->JDR4;
            break;
        default:
            return HAL_ERR_INVALID_ARG;
    }

    return HAL_OK;
}


